ХМНПФ_Общее/Documents/уп_РешениеОЕдиновременнойВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РешениеОЕдиновременнойВыплате</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЕдиновременнойВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНаСчете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяВыплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоначислениеПоПереданномуВзносуИзПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_РазмерГП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_СрокПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаГосПенсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаСозданияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеУчитыватьДопВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаГарантированная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВосполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВозмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_ДатаВыплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыРезервовОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыРезервовОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервПенсионныйНакоплений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервСрочнойВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплатной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РешениеОЕдиновременнойВыплате/Forms/уф_ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры 

Процедура ХМДополнитьФорму()	
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("ВставитьПередЭлементом", Элементы.ГруппаПодвал);
	СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_Госпенсия",ЭтаФорма,СвойстваГруппы);

	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_СрокПП",Элементы["ХМ_Госпенсия"],"Объект.ХМ_СрокПП");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_РазмерГП",Элементы["ХМ_Госпенсия"],"Объект.ХМ_РазмерГП");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДатаГосПенсии",Элементы["ХМ_Госпенсия"],"Объект.ХМ_ДатаГосПенсии");
		
КонецПроцедуры  

// ХМНПФ 28.03.2017 ШадринАВ // Новая ХМ_ПриОткрытии() // №868
&НаКлиенте
Процедура ХМ_ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ХМ_ДатаСозданияДокумента = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

// ХМНПФ 03.05.2017 ШадринАВ // Новая ХМ_ПослеЗаписи() // №920
&НаКлиенте
Процедура ХМ_ПослеЗаписи(ПараметрыЗаписи)
	ХМ_ПослеЗаписиСервер();
КонецПроцедуры

// ХМНПФ 04.05.2018 КлименкоМИ // Новая ХМ_ПослеЗаписиСервер() // №1555
&НаСервере
Процедура ХМ_ПослеЗаписиСервер()
	//ПослеЗаписи(ПараметрыЗаписи);
	Если Объект.Проведен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РешениеЕДВ.ДоговорОПС,
			|	МАКСИМУМ(РешениеЕДВ.Дата) КАК Дата
			|ИЗ
			|	Документ.уп_РешениеОЕдиновременнойВыплате КАК РешениеЕДВ
			|ГДЕ
			|	РешениеЕДВ.ДоговорОПС = &ДоговорОПС
			|	И НЕ РешениеЕДВ.Ссылка = &Ссылка
			|	И РешениеЕДВ.Проведен
			|	И РешениеЕДВ.Дата >= &ДатаДок
			|
			|СГРУППИРОВАТЬ ПО
			|	РешениеЕДВ.ДоговорОПС";
		
		Запрос.УстановитьПараметр("ДоговорОПС", Объект.ДоговорОПС);
		Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		ВыборкаРешения = Запрос.Выполнить().Выбрать();
		Если ВыборкаРешения.Следующий() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РезервыОПС.ДоговорОПС,
				|	РезервыОПС.СуммаОстаток
				|ИЗ
				|	РегистрНакопления.уп_РезервыОПС.Остатки(
				|			&ДатаОстатков,
				|			ДоговорОПС = &ДоговорОПС
				|				И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)) КАК РезервыОПС";
			
			Запрос.УстановитьПараметр("ДатаОстатков", ВыборкаРешения.Дата+1);
			Запрос.УстановитьПараметр("ДоговорОПС", Объект.ДоговорОПС);
			
			ВыборкаОстатки = Запрос.Выполнить().Выбрать();
			Если ВыборкаОстатки.Следующий() Тогда
				Если ВыборкаОстатки.СуммаОстаток < 0 Тогда
					Сообщить("Внимание! Отрицательный остаток " + Строка(ВыборкаОстатки.СуммаОстаток) + " по договору " + Объект.ДоговорОПС + " в результате проведения задним числом " + Строка(Объект.Ссылка), СтатусСообщения.ОченьВажное);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 15.12.2015 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 15.12.2015 ШадринАВ // ПриСозданииНаСервере()
	// ХМНПФ 28.03.2017 ШадринАВ // Новая ХМ_ПриОткрытии() // №868
	// ХМНПФ 03.05.2017 ШадринАВ // Новая ХМ_ПослеЗаписи() // №920
	// ХМНПФ 04.05.2018 КлименкоМИ // Новая ХМ_ПослеЗаписиСервер() // №1555
	
	// ХМНПФ+ 15.01.2016 ШадринАВ // Новый реквизит ХМ_РазмерГП // №133
	// ХМНПФ+ 15.01.2016 ШадринАВ // Новый реквизит ХМ_СрокПП // №133
	// ХМНПФ+ 20.01.2016 ШадринАВ // Новый реквизит ХМ_ДатаГосПенсии // №138
КонецПроцедуры

// ХМНПФ 15.12.2015 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	ХМ_ПриОткрытии(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ХМПослеЗаписиПосле(ПараметрыЗаписи)
	ХМ_ПослеЗаписи(ПараметрыЗаписи);
КонецПроцедуры
